{"config": {"name": "sequential_2", "layers": [{"config": {"activation": "linear", "filters": 64, "batch_input_shape": [null, 100, 100, 3], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_10", "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_14", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_14", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_10", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_14", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "filters": 128, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_11", "dtype": "float32", "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_15", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_15", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_11", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_15", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "filters": 256, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_12", "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_16", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_16", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_12", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_16", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "filters": 512, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_13", "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_17", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_17", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_13", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_17", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "filters": 1024, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_14", "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_18", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_18", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_14", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "name": "dropout_18", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2", "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_6", "units": 1024, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_19", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [1], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_19", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_19", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_7", "units": 512, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "batch_normalization_20", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [1], "center": true, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_20", "dtype": "float32", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_20", "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_8", "units": 131, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}]}, "keras_version": "2.1.6-tf", "backend": "tensorflow", "class_name": "Sequential"}